["<UNK>", "<BOS>", "<EOS>", "$", "'", "''", "'s", "*", ",", "-lrb-", "-rrb-", ".", "0", "1", "10", "100", "1000", "10000", "100000", "10000000", "11", "111", "1121", "12", "120", "12000", "15", "150", "1500", "160", "18", "180", "18000", "1850", "1961", "1978-06-26", "1980", "1989", "1989-09-03", "1990", "1994", "1995", "1996", "1998", "1999", "2", "20", "200", "2000", "20000", "2001", "2002", "2003", "2004", "2005", "2006", "2007", "2007-12-25", "2008", "2009", "2010", "2011", "2012", "2013", "2014", "2015", "2016", "2017", "23", "25", "3", "3.5", "30", "300", "3000", "301", "32", "3452", "4", "40", "4000", "4560596484842", "46", "5", "50", "500", "5000", "50000", "5000000", "5th", "60", "600", "6000", "7", "70", "700", "737-800", "8", "80", "800", "8000", "80000", "841", "85", "9", "90", "900", "94107", ":", "<type: boolean>", "<type: number>", "<type: others>", "<type: text>", "<type: time>", "?", "_", "`", "``", "a", "a340-300", "a4", "about", "above", "acc", "accelerator", "accelerators", "acceptance", "accepted", "access", "accessed", "accessible", "accidents", "accommodate", "account", "accounting", "accounts", "accreditation", "acct-211", "acl", "across", "acted", "acting", "active", "activities", "activity", "actor", "actors", "acts", "actual", "address", "addressed", "addresses", "adults", "advise", "advised", "advises", "advisor", "advisors", "affected", "affiliated", "affiliation", "affirmative", "afghanistan", "after", "age", "aged", "agent", "ages", "aid", "airbus", "aircraft", "aircrafts", "airline", "airlines", "airport", "airports", "aistats", "ala", "alabama", "alameda", "alan", "alaska", "album", "albums", "alice", "alidoosti", "all", "allergic", "allergies", "allergy", "along", "alphabetic", "alphabetical", "alphabetically", "also", "altitude", "alto", "amenities", "amenity", "america", "american", "americano", "among", "amount", "amounts", "an", "and", "angeles", "animal", "annual", "answering", "any", "apartment", "apartments", "api", "appeared", "appears", "appelation", "appelations", "appointment", "appointments", "appropriations", "approval", "approved", "april", "arabic", "arabics", "architect", "architects", "are", "area", "areas", "arrival", "art", "articles", "artist", "artists", "artwork", "artworks", "as", "ascending", "asghar", "ashley", "assessment", "asset", "assets", "assigned", "associated", "astrid", "at", "atlanta", "attend", "attendance", "attendances", "attended", "attendees", "attraction", "attractions", "attribute", "audience", "audio", "austin", "australia", "australian", "author", "authored", "authorised", "authority", "authors", "availability", "available", "average", "award", "awarded", "awards", "back", "badlands", "bal", "balance", "balances", "balls", "baltimore", "band", "bangla", "bank", "banking", "banks", "bar", "barbian", "bars", "base", "based", "basketball", "bathroom", "bathrooms", "bay", "bb", "be", "became", "bed", "bedrooms", "beds", "been", "before", "behavior", "beijing", "belong", "belonging", "belongs", "below", "benjamin", "bernhard", "best", "bethel", "between", "big", "bigger", "biggest", "bike", "bikes", "billed", "billing", "billion", "biology", "birth", "birthday", "bk", "black", "blei", "block", "bob", "body", "boeing", "bond", "book", "booked", "booking", "bookings", "books", "bootup", "border", "bordering", "borders", "born", "bosco", "boston", "both", "bought", "boulder", "branch", "branches", "brand", "brian", "bridge", "bridges", "brittany", "broadcast", "brown", "browser", "browsers", "buchanan", "budget", "budgeted", "budgets", "builder", "builders", "building", "buildings", "buildup", "built", "bus", "business", "businesses", "but", "buying", "by", "c", "ca", "cafe", "calendar", "california", "call", "callan", "called", "camera", "cameron", "campus", "campuses", "can", "canada", "cancelled", "candidate", "candidates", "canoeing", "capacity", "capital", "capitals", "captain", "captains", "card", "cards", "carlo", "carole", "carrier", "carriers", "cascade", "case", "cash", "cat", "catalog", "catalogs", "categories", "category", "cctv", "cell", "central", "ceremony", "certificate", "certificates", "chain", "chance", "channel", "channels", "character", "characteristic", "characteristics", "characters", "charge", "chaudhuri", "cheapest", "check", "checked", "checking", "checkins", "chervil", "chi", "chicago", "china", "chinese", "chip", "chris", "christof", "christop", "christopher", "church", "churches", "cid", "cinema", "cinemas", "circuits", "circulation", "cis-220", "citation", "citations", "cite", "cited", "cities", "citing", "citizens", "city", "claim", "claimed", "claims", "clara", "class", "classes", "classroom", "classrooms", "clerical", "client", "clients", "climb", "climbed", "climber", "climbers", "close", "cloud", "club", "clubs", "cmi", "co-authors", "coach", "coaches", "coast", "coaster", "coasters", "code", "codes", "coelho", "college", "colleges", "color", "colorado", "colors", "columbus", "combined", "come", "commission", "committee", "committees", "common", "communications", "companies", "company", "compatible", "competition", "competitions", "complaint", "complaints", "complete", "completion", "components", "composer", "comptroller", "compute", "computer", "conference", "conferences", "conferred", "confirmed", "consider", "constructor", "constructors", "contact", "contacted", "contain", "contained", "containing", "contains", "content", "contents", "contract", "convolution", "convolutional", "cooperated", "copies", "corporation", "correspond", "corresponding", "cost", "costs", "council", "count", "counties", "countries", "country", "counts", "county", "coupon", "course", "courses", "cover", "created", "creation", "credit", "credits", "crew", "crime", "cross", "crossing", "cs", "csu", "cuisine", "cumin", "cup", "curless", "customer", "customers", "cv", "cvpr", "cycle", "d", "d.", "dallas", "dallermassl", "damage", "dan", "daniel", "daniella", "data", "database", "databases", "dataset", "datasets", "date", "dates", "datetime", "david", "day", "dayana", "days", "death", "deaths", "debate", "debates", "decision", "decor", "decreasing", "deep", "defence", "defender", "definitions", "degree", "degrees", "delaware", "delegate", "delegates", "delivered", "delivery", "democratic", "denmark", "denomination", "denominations", "density", "department", "departments", "departure", "dependent", "deputy", "der", "descending", "described", "description", "descriptions", "desmond", "destination", "destinations", "destiny", "destroyed", "destruction", "detail", "detailed", "details", "detention", "device", "devices", "dew", "diana", "did", "different", "dina", "direct", "directed", "director", "directors", "display", "distance", "distances", "distinct", "district", "districts", "div", "divesh", "division", "do", "document", "documents", "does", "dollars", "domain", "domestic", "donation", "donator", "done", "dong", "donor", "dorm", "dorms", "draft", "drama", "dribbling", "driver", "drivers", "duke", "duration", "durations", "during", "dyer", "e", "each", "earlier", "earliest", "earn", "earning", "east", "eat", "ebba", "eccv", "ed", "editor", "editors", "edwards", "effective", "either", "election", "elections", "electoral", "elevation", "eliminated", "elimination", "eliminations", "elsa", "email", "emails", "emnlp", "employee", "employees", "end", "ended", "ending", "endowment", "engineer", "engineers", "english", "enroll", "enrolled", "enrollment", "enrollments", "enter", "enterprises", "entrepreneur", "entrepreneurs", "entries", "entry", "enzyme", "enzymes", "equal", "eric", "ernser", "escape", "estimate", "estimation", "estimations", "etzioni", "event", "events", "ever", "every", "exactly", "except", "exhibition", "exhibitions", "exist", "expense", "expenses", "expensive", "express", "f", "facility", "factories", "faculties", "faculty", "fail", "fall", "fame", "family", "famous", "farhadi", "farm", "farms", "fast", "fastest", "fault", "faults", "fax", "fda", "feature", "features", "featuring", "fee", "feet", "female", "females", "festival", "festivals", "fewer", "fewest", "fifa", "file", "filed", "files", "film", "films", "finance", "financial", "find", "first", "five", "fix", "flag", "flags", "flax", "flied", "flight", "flights", "floor", "floors", "florida", "flow", "flows", "fly", "followed", "followers", "food", "football", "for", "force", "forces", "forename", "forenames", "form", "format", "formed", "forms", "fosse", "founded", "founder", "four", "franchise", "francisco", "french", "frequency", "frequent", "frequently", "friend", "friends", "from", "full", "functional", "furniture", "furnitures", "fusion", "g", "gallery", "game", "games", "gaming", "gas", "gatwick", "gdp", "gender", "genders", "genre", "genres", "germany", "get", "giuliano", "give", "given", "gk", "go", "goalie", "goalies", "gold", "goldwater", "good", "goodwin", "google", "got", "governor", "governors", "gpa", "grade", "grand", "grande", "grant", "granted", "grants", "grape", "grapes", "greater", "greatest", "grill", "gross", "group", "grouped", "groups", "gruber", "gs", "guest", "guests", "gymnast", "gymnasts", "h", "h.", "had", "half", "hall", "handled", "happened", "happy", "hardware", "harris", "hartford", "has", "have", "having", "hbp", "he", "head", "headquarter", "headquarters", "heads", "heaney", "heathrow", "height", "heights", "heilo", "held", "heme", "her", "herbs", "high", "higher", "highest", "hill", "hire", "hired", "his", "history", "hkg", "hold", "home", "homenick", "homepage", "hometown", "hometowns", "honolulu", "hopkins", "horses", "hosseini", "host", "hosted", "hosts", "hot", "hotel", "hotels", "hour", "hours", "how", "hr", "human", "humidity", "i", "i.", "iata", "ibb", "id", "idaho", "idp", "ids", "if", "illinois", "image", "imagenet", "images", "imitation", "in", "inches", "incident", "include", "includes", "increasing", "individual", "individuals", "industries", "industry", "info", "information", "inhibitor", "initial", "injured", "injury", "inn", "institution", "institutions", "instructor", "instructors", "instrument", "instruments", "insurance", "interact", "interaction", "interactions", "international", "inventory", "invested", "investor", "investors", "invoice", "invoices", "involved", "iowa", "is", "island", "issue", "it", "italian", "italy", "item", "items", "its", "jagadish", "jamerican", "james", "jamie", "janessa", "japan", "jason", "jazz", "jeopardy!", "jeramie", "jitendra", "job", "jobs", "john", "join", "joined", "jordan", "jose", "journal", "journalist", "journalists", "journals", "july", "jurafsky", "kansas", "kapitan", "kayaking", "kentucky", "kevin", "key", "keyphrases", "keyword", "keywords", "kid", "kids", "kim", "kind", "kinds", "king", "kingdom", "l", "la", "label", "labels", "lacrosse", "ladner", "lake", "lakes", "lamberton", "language", "languages", "lap", "lapata", "laptime", "large", "larger", "largest", "last", "lasted", "later", "latest", "latitude", "latte", "launch", "launched", "le", "lead", "leader", "league", "learning", "least", "leave", "led", "left", "left-footed", "length", "lens", "lenses", "less", "lesson", "lessons", "letter", "level", "lewis", "li", "lieutenant", "likes", "linda", "line", "lines", "list", "listed", "live", "lived", "lives", "living", "liwen", "loan", "loans", "local", "located", "location", "locations", "log", "logged", "login", "logs", "london", "long", "longer", "longest", "longitude", "los", "loss", "lot", "lots", "lounge", "low", "lower", "lowest", "luke", "m", "m.", "machine", "machines", "made", "madison", "mailshot", "mailshots", "main", "maintenance", "major", "majoring", "majors", "make", "making", "male", "malik", "man", "manage", "managed", "manager", "managers", "managing", "mancini", "manning", "manufacturer", "manufacturers", "many", "march", "marianne", "mark", "market", "marketing", "markets", "mary", "master", "match", "matches", "mate", "math", "max", "maximum", "me", "meaghan", "mean", "measure", "measurement", "medals", "media", "medication", "medications", "medicine", "medicines", "member", "members", "membership", "memberships", "mertens", "meter", "meters", "method", "methods", "mexico", "michael", "michelle", "michigan", "mid", "middle", "midshipman", "miles", "milk", "mill", "millions", "milliseconds", "mills", "min", "minimum", "minister", "ministers", "minute", "minutes", "mirella", "mission", "mississippi", "mobile", "mode", "model", "models", "modern", "monaco", "money", "mono", "monte", "month", "monthly", "more", "morning", "moroccan", "most", "mount", "mountain", "mountains", "move", "moved", "movie", "movies", "moyer", "mp3", "mp4", "mpeg", "mph", "msid", "much", "museum", "music", "musical", "musicals", "musician", "musicians", "n't", "name", "named", "names", "nancy", "nationalities", "nationality", "nations", "native", "nature", "neb", "neb.", "neighbourhood", "network", "networks", "neural", "never", "new", "next", "nickname", "nicknames", "night", "niloofar", "nips", "no", "noah", "nokia", "nominated", "nominee", "nominees", "north", "not", "notes", "notification", "null", "num", "number", "numbers", "nurse", "nurses", "ny", "nyc", "occupation", "occurred", "oct", "of", "offer", "offered", "offers", "office", "officers", "offices", "official", "often", "ohad", "ohio", "ohori", "oklahoma", "old", "older", "oldest", "on", "once", "one", "only", "open", "opened", "opening", "opera", "operate", "operated", "operating", "oppose", "or", "orange", "order", "ordered", "orders", "oren", "organisation", "organisations", "organization", "organizations", "origin", "origins", "orton", "otha", "other", "our", "out", "outcome", "outcomes", "outstanding", "over", "overall", "owned", "owner", "owners", "page", "pages", "paid", "palo", "paper", "papers", "parent", "park", "parking", "parks", "parsing", "part", "participant", "participants", "participate", "participated", "participating", "parties", "parts", "party", "pass", "passengers", "passing", "password", "past", "patient", "patients", "patrick", "payment", "payments", "peak", "pen", "pending", "pennsylvania", "people", "per", "percent", "percentage", "percentages", "performance", "performances", "performed", "performer", "perpetrator", "perpetrators", "person", "personal", "persons", "pet", "peter", "ph.d.", "phone", "phones", "photo", "photos", "phrase", "physician", "physicians", "physics", "picture", "pid", "pilot", "pilots", "pit", "place", "placed", "places", "planned", "platform", "platforms", "play", "played", "player", "players", "playing", "playlist", "playlists", "pldi", "please", "point", "points", "police", "policies", "policy", "poll", "pop", "popular", "population", "populations", "populous", "position", "positioning", "positions", "post", "postal", "postcode", "postseason", "pounds", "precipitation", "premise", "premises", "prerequisite", "prerequisites", "prescribe", "prescribed", "president", "pressure", "price", "prices", "primarily", "primary", "private", "prix", "problem", "problems", "procedures", "processed", "processing", "procrastin-x", "produce", "produced", "produces", "product", "production", "products", "professor", "professors", "profits", "program", "programs", "progress", "project", "projects", "prominence", "property", "protein", "provide", "provided", "province", "provisional", "psychiatry", "psychology", "public", "publication", "publications", "publish", "published", "publisher", "publishers", "publishes", "pur", "purchase", "purchased", "purchases", "pvldb", "qm-261", "qualification", "quantities", "quantity", "quentin", "question", "questions", "r", "race", "races", "railway", "railways", "ram", "range", "ranges", "rank", "ranking", "ranks", "rate", "rated", "rates", "rating", "ratings", "ray", "rd", "reached", "receipt", "receive", "received", "recent", "recently", "recognition", "record", "recorded", "records", "red", "reference", "references", "regarding", "region", "regional", "regions", "register", "registered", "registration", "regular", "reigns", "related", "relational", "relationship", "release", "released", "rental", "rented", "repair", "report", "reported", "representative", "representatives", "requested", "require", "research", "researcher", "researchers", "reservations", "reserved", "residence", "resident", "residents", "resolution", "resource", "response", "restaurant", "restaurants", "result", "results", "retrieve", "return", "revenue", "revenues", "review", "reviewed", "reviewer", "reviewers", "reviews", "richard", "rio", "river", "rivers", "road", "robards", "robel", "robin", "rock", "rodrick", "role", "roles", "roller", "room", "rooms", "round", "route", "routes", "roy", "royal", "run", "runs", "ryan", "rylan", "s", "salaries", "salary", "sale", "salem", "sales", "same", "san", "sang", "saving", "savings", "sawayn", "sb", "scholarship", "school", "schools", "science", "scientist", "scientists", "score", "scores", "screen", "sea", "season", "seasons", "seating", "seats", "second", "secretary", "section", "sections", "select", "semantic", "semester", "senator", "sensor", "sequence", "series", "serve", "served", "serves", "service", "services", "sesame", "settled", "settlement", "settlements", "sex", "sf", "sh", "shahab", "shamir", "share", "shared", "shark", "sharon", "ship", "shipment", "shipped", "shipping", "ships", "shop", "shops", "short", "shorter", "shortest", "show", "side", "sigir", "silver", "simulation", "since", "singers", "single", "size", "sizes", "skill", "skills", "smaller", "smallest", "smith", "smithson", "snatch", "so", "software", "solveig", "some", "someone", "song", "songs", "sonoma", "sony", "sort", "sorted", "source", "south", "spacey", "spain", "span", "speed", "speeds", "spend", "spent", "spices", "spielberg", "sport", "sports", "spring", "springfield", "square", "srivastava", "ssn", "stadium", "stadiums", "staff", "staffs", "stage", "standing", "standings", "star", "stars", "start", "started", "starting", "starts", "state", "statement", "statements", "states", "station", "stations", "statistics", "status", "statuses", "stay", "staying", "steven", "stint", "stock", "stockings", "stocks", "stonebraker", "stop", "stops", "store", "stored", "stores", "stories", "storm", "storms", "street", "striker", "strode", "structure", "student", "students", "studio", "studios", "study", "studying", "subhasis", "subject", "submission", "submissions", "submit", "substring", "subway", "sum", "sung", "supplied", "supplier", "suppliers", "support", "surgery", "surname", "swimmer", "swimmers", "syntactic", "system", "systems", "t", "table", "tail", "take", "taken", "taking", "tallest", "taraneh", "tarantino", "target", "task", "tasks", "taught", "tax", "teach", "teacher", "teachers", "teaches", "teaching", "team", "teams", "technician", "technicians", "tell", "temperature", "tennessee", "tennis", "terms", "test", "tests", "texas", "text", "than", "that", "the", "their", "them", "theme", "themes", "then", "there", "these", "they", "thing", "things", "third", "this", "those", "three", "through", "ticket", "ties", "tillman", "time", "times", "tips", "title", "titled", "titles", "to", "together", "tokyo", "tonnage", "tony", "took", "top", "topic", "topics", "total", "tourist", "tourists", "tournament", "town", "track", "tracking", "tracks", "trade", "train", "trained", "training", "trains", "transaction", "transactions", "traverses", "treasurer", "treatment", "tried", "trip", "trips", "trophic", "truck", "trust", "tryout", "tryouts", "turcotte", "turing", "turon", "tutor", "tutors", "tv", "tweeted", "tweets", "twice", "two", "type", "types", "typical", "typically", "ucla", "ueno", "uk", "under", "undergoing", "unique", "unit", "united", "universal", "universities", "university", "unsure", "up", "update", "url", "us", "usa", "usable", "usd", "use", "used", "user", "users", "using", "utah", "v.", "valid", "value", "values", "vat", "vehicle", "velocity", "venue", "venues", "vice", "video", "view", "village", "vincent", "visibility", "visit", "visited", "visits", "vldb", "vocal", "vocals", "volume", "volumes", "voluptatem", "vote", "votes", "voting", "w", "walk", "wall", "walter", "was", "washington", "we", "web", "webkb", "wedding", "weddings", "week", "weeks", "weight", "well", "wen", "were", "west", "what", "when", "where", "which", "white", "whitney", "who", "whose", "wifi", "win", "wind", "wine", "wineries", "winery", "wines", "winning", "wins", "wisconsin", "with", "within", "without", "won", "woody", "word", "work", "worked", "working", "works", "workshop", "world", "wrestler", "wrestlers", "write", "writer", "writes", "written", "wrote", "wyoming", "x", "xiong", "y", "year", "years", "yellow", "yes", "york", "yosemite", "you", "young", "younger", "youngest", "yunyao", "zach", "zettlemoyer", "zinho", "zip"]